# encoding: utf-8
"""
题目：打印出如下图案（菱形）

   *
  ***
 *****
*******
 *****
  ***
   *
1.程序分析：先把图形分成两部分来看待，前四行一个规律，后三行一个规律，利用双重
　　　　　　for循环，第一层控制行，第二层控制列。
2.程序源代码：
"""

print(' ' * 3 + '*' * 1 + ' ' * 3)
print(' ' * 2 + '*' * 3 + ' ' * 2)
print(' ' * 1 + '*' * 5 + ' ' * 1)
print(' ' * 0 + '*' * 7 + ' ' * 0)
print(' ' * 1 + '*' * 5 + ' ' * 1)
print(' ' * 2 + '*' * 3 + ' ' * 2)
print(' ' * 3 + '*' * 1 + ' ' * 3)

for i in range(4):
    print(' ' * (3 - i) + '*' * (1 + 2 * i) + ' ' * (3 - i))
for i in range(3):
    print(' ' * (1 + i) + '*' * (5 - 2 * i) + ' ' * (1 + i))